###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/81ee270f-cb93-4022-87ab-00247e140ca9/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "nisalikularatne.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.nisalikularatne.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "nisalikularatne.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.nisalikularatne.ca",
          + "nisalikularatne.ca",
        ]
      + tags                      = {
          + "Environment" = "dev"
          + "Name"        = "skills-dev-cert"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "Name"        = "skills-dev-cert"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb_listener.http will be created
  + resource "aws_alb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.https will be created
  + resource "aws_alb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_alb_listener_rule.rule2 will be created
  + resource "aws_alb_listener_rule" "rule2" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/pink",
                ]
            }
        }
    }

  # aws_alb_target_group.blue will be created
  + resource "aws_alb_target_group" "blue" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "skills-tg-dev-blue"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "skills-tg-dev-blue"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "skills-tg-dev-blue"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/blue"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_alb_target_group.pink will be created
  + resource "aws_alb_target_group" "pink" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "skills-tg-dev-pink"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "skills-tg-dev-pink"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "skills-tg-dev-pink"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/pink"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_appautoscaling_policy.this will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "blue-service-scaling-policy"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/skills-dev-cluster/skills-dev-service-blue"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 50

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # aws_appautoscaling_target.this will be created
  + resource "aws_appautoscaling_target" "this" {
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 2
      + resource_id        = "service/skills-dev-cluster/skills-dev-service-blue"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + query  = <<-EOT
                                SOURCE '/aws/rds/instance/skills-dev-db/slowquery' | #fields  @message
                                 parse  @message "# Time: * User@Host: * Id: * Query_time: * Lock_time: * Rows_sent: * Rows_examined: * timestamp=*;*" 
                                 as Time, User, Id, Query_time,Lock_time,Rows_sent,Rows_examined,timestamp,query
                                 | sort Time asc
                                 
                            EOT
                          + region = "us-east-1"
                          + title  = "Slow queries with detailed info"
                          + view   = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query  = <<-EOT
                                SOURCE '/aws/rds/instance/skills-dev-db/slowquery' | parse  @message "# Time: * User@Host: * Id: * Query_time: * Lock_time: * Rows_sent: * Rows_examined: * timestamp=*;*" 
                                as Time, User, Id, Query_time,Lock_time,Rows_sent,Rows_examined,timestamp,Query 
                                | display Time, Query_time, Query
                                | sort Query_time desc
                                 
                                
                            EOT
                          + region = "us-east-1"
                          + title  = "Top Slow Queries sorted by Query Time"
                          + view   = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 6
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/RDS",
                                  + "ConnectionAttempts",
                                  + "DBInstanceIdentifier",
                                  + "skills-dev-db",
                                  + {
                                      + visible = false
                                    },
                                ],
                              + [
                                  + ".",
                                  + "RowLockTime",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "DMLLatency",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "InsertLatency",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "InsertThroughput",
                                  + ".",
                                  + ".",
                                  + {
                                      + visible = false
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Deadlocks",
                                  + ".",
                                  + ".",
                                ],
                            ]
                          + period  = 60
                          + region  = "us-east-1"
                          + stacked = true
                          + stat    = "Average"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 24
                      + x          = 0
                      + y          = 18
                    },
                  + {
                      + height     = 9
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/RDS",
                                  + "ConnectionAttempts",
                                  + "DBInstanceIdentifier",
                                  + "skills-dev-db",
                                  + {
                                      + visible = false
                                    },
                                ],
                              + [
                                  + ".",
                                  + "DatabaseConnections",
                                  + ".",
                                  + ".",
                                  + {
                                      + stat = "Maximum"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "AbortedClients",
                                  + ".",
                                  + ".",
                                  + {
                                      + visible = false
                                    },
                                ],
                            ]
                          + period  = 60
                          + region  = "us-east-1"
                          + stacked = true
                          + stat    = "Average"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 24
                      + x          = 0
                      + y          = 24
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/RDS",
                                  + "CPUUtilization",
                                  + "DBInstanceIdentifier",
                                  + "skills-dev-db",
                                ],
                            ]
                          + period  = 60
                          + region  = "us-east-1"
                          + stacked = true
                          + title   = "DB CPUUtilization"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 24
                      + x          = 0
                      + y          = 33
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/RDS",
                                  + "DMLThroughput",
                                  + "DBInstancceIdentifier",
                                  + "skills-dev-db",
                                ],
                              + [
                                  + ".",
                                  + "DeleteThroughput",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "InsertThroughput",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "UpdateThroughput",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "SelectThroughput",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "CommitThroughput",
                                  + ".",
                                  + ".",
                                ],
                            ]
                          + region  = "us-east-1"
                          + stacked = true
                          + title   = "DB workLoad - CommitThroughput, DMLThroughput, DeleteThroughput, InsertThroughput, SelectThroughput, UpdateThroughput"
                          + view    = "timeSeries"
                        }
                      + type       = "metric"
                      + width      = 24
                      + x          = 0
                      + y          = 39
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query  = <<-EOT
                                SOURCE '/aws/rds/instance/skills-dev-db/error' | fields @message
                                | sort @timestamp desc
                                | limit 200
                            EOT
                          + region = "us-east-1"
                          + title  = "Top 200 lines of Error Log"
                          + view   = "table"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 12
                    },
                  + {
                      + height     = 9
                      + properties = {
                          + end       = "P0D"
                          + legend    = {
                              + position = "bottom"
                            }
                          + metrics   = [
                              + [
                                  + "AWS/EC2",
                                  + "CPUUtilization",
                                  + "InstanceId",
                                  + "i-0e8d66ed4385b0ec2",
                                  + {
                                      + id      = "m1"
                                      + stat    = "Average"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "AVG([m1])"
                                      + id         = "e1"
                                      + label      = "us-east-1c"
                                      + region     = "us-east-1"
                                    },
                                ],
                              + [
                                  + "ECS/ContainerInsights",
                                  + "ContainerInstanceCount",
                                  + "ClusterName",
                                  + "skills-dev-cluster",
                                  + {
                                      + id = "m2"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "ServiceCount",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m3"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "TaskCount",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m4"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "CpuUtilized",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m5"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "StorageWriteBytes",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m6"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryReserved",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m7"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "CpuReserved",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m8"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "EphemeralStorageUtilized",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m9"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "NetworkTxBytes",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m10"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "EphemeralStorageReserved",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m11"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryUtilized",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m12"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "StorageReadBytes",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m13"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "NetworkRxBytes",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m14"
                                    },
                                ],
                            ]
                          + period    = 300
                          + region    = "us-east-1"
                          + sparkline = true
                          + stacked   = true
                          + start     = "-PT3H"
                          + title     = "ECS Cluster Metrics"
                          + view      = "singleValue"
                        }
                      + type       = "metric"
                      + width      = 24
                      + x          = 0
                      + y          = 45
                    },
                  + {
                      + height     = 24
                      + properties = {
                          + metrics = [
                              + [
                                  + "ECS/ContainerInsights",
                                  + "EphemeralStorageUtilized",
                                  + "ServiceName",
                                  + "skills-dev-service-blue",
                                  + "ClusterName",
                                  + "skills-dev-cluster",
                                ],
                              + [
                                  + ".",
                                  + "NetworkTxBytes",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "EphemeralStorageReserved",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "StorageReadBytes",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "MemoryUtilized",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "NetworkRxBytes",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "RunningTaskCount",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "PendingTaskCount",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "MemoryReserved",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "StorageWriteBytes",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "CpuUtilized",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "DeploymentCount",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "DesiredTaskCount",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                              + [
                                  + ".",
                                  + "TaskSetCount",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                ],
                            ]
                          + region  = "us-east-1"
                          + title   = "Blue Service ECS cluster"
                          + view    = "gauge"
                          + yAxis   = {
                              + left = {
                                  + max = 2000
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 24
                      + x          = 0
                      + y          = 54
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + end     = "P0D"
                          + legend  = {
                              + position = "bottom"
                            }
                          + metrics = [
                              + [
                                  + "AWS/EC2",
                                  + "CPUUtilization",
                                  + "InstanceId",
                                  + "i-0e8d66ed4385b0ec2",
                                  + {
                                      + id      = "m1"
                                      + stat    = "Average"
                                      + visible = false
                                    },
                                ],
                              + [
                                  + {
                                      + expression = "AVG([m1])"
                                      + id         = "e1"
                                      + label      = "us-east-1c"
                                      + region     = "us-east-1"
                                    },
                                ],
                              + [
                                  + "ECS/ContainerInsights",
                                  + "CpuReserved",
                                  + "TaskDefinitionFamily",
                                  + "skills-dev-task-blue",
                                  + "ClusterName",
                                  + "skills-dev-cluster",
                                  + {
                                      + id = "m2"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "EphemeralStorageUtilized",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m3"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "NetworkTxBytes",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m4"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "EphemeralStorageReserved",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m5"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryUtilized",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m6"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "StorageReadBytes",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m7"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "NetworkRxBytes",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m8"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "CpuUtilized",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m9"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "StorageWriteBytes",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m10"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "MemoryReserved",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + ".",
                                  + {
                                      + id = "m12"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "us-east-1"
                          + stacked = false
                          + start   = "-PT3H"
                          + title   = "ECS Cluster blue task definition metrics"
                          + view    = "bar"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 0
                      + y          = 78
                    },
                ]
            }
        )
      + dashboard_name = "database-dashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "skills-dev-cloudwatch-log-group"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "skills-dev-cloudwatch-log-group"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "skills-dev-cloudwatch-log-group"
        }
    }

  # aws_cloudwatch_log_stream.todo_container_cloudwatch_logstream will be created
  + resource "aws_cloudwatch_log_stream" "todo_container_cloudwatch_logstream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "skills-dev-cloudwatch-log-group"
      + name           = "skills-dev-cloudwatch-log-stream"
    }

  # aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 25
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "application"
      + db_subnet_group_name                  = "skills-dev-rds-subnet-group"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + enabled_cloudwatch_logs_exports       = [
          + "audit",
          + "error",
          + "general",
          + "slowquery",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "skills-dev-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "slowquery-parameter-group"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "application"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_parameter_group.slowQuery will be created
  + resource "aws_db_parameter_group" "slowQuery" {
      + arn         = (known after apply)
      + description = "Slow Query parameter group"
      + family      = "mysql5.7"
      + id          = (known after apply)
      + name        = "slowquery-parameter-group"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "log_output"
          + value        = "FILE"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "long_query_time"
          + value        = "1.0"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "slow_query_log"
          + value        = "1"
        }
    }

  # aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "skills-dev-rds-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "skills-dev-rds-subnet-group"
        }
      + tags_all                = {
          + "Name" = "skills-dev-rds-subnet-group"
        }
    }

  # aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "keep last 3 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "skills-dev-repo"
    }

  # aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "skills-dev-repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "skills-dev-repo"
        }
      + tags_all             = {
          + "Name" = "skills-dev-repo"
        }
    }

  # aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "skills-dev-cluster"
      + tags               = {
          + "Name" = "skills-dev-fargate-cluster"
        }
      + tags_all           = {
          + "Name" = "skills-dev-fargate-cluster"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.blue will be created
  + resource "aws_ecs_service" "blue" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "skills-dev-service-blue"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "skills-dev-container"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.blue will be created
  + resource "aws_ecs_task_definition" "blue" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::457234550057:role/ecsTaskExecutionRole"
      + family                   = "skills-dev-task-blue"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "dev"
          + "Name"        = "skills-dev-task"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "skills-dev-task"
        }
      + task_role_arn            = "arn:aws:iam::457234550057:role/ecsTaskExecutionRole"
    }

  # aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "skills-alb-dev"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Environment" = "dev"
          + "Name"        = "skills-alb-dev"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "Name"        = "skills-alb-dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_route53_record.this["*.nisalikularatne.ca"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z093297817GYDKUHI13ZM"
    }

  # aws_route53_record.this["nisalikularatne.ca"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z093297817GYDKUHI13ZM"
    }

  # aws_secretsmanager_secret.this will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "application-database-password-nineo"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.rds_credentials will be created
  + resource "aws_secretsmanager_secret_version" "rds_credentials" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.this will be created
  + resource "aws_secretsmanager_secret_version" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # random_password.this will be created
  + resource "random_password" "this" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_!%^"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.dynamic_subnets.aws_eip.default[0] will be created
  + resource "aws_eip" "default" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Attributes" = "nat"
          + "Name"       = "nat-use1a"
        }
      + tags_all             = {
          + "Attributes" = "nat"
          + "Name"       = "nat-use1a"
        }
      + vpc                  = true
    }

  # module.dynamic_subnets.aws_eip.default[1] will be created
  + resource "aws_eip" "default" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Attributes" = "nat"
          + "Name"       = "nat-use1b"
        }
      + tags_all             = {
          + "Attributes" = "nat"
          + "Name"       = "nat-use1b"
        }
      + vpc                  = true
    }

  # module.dynamic_subnets.aws_nat_gateway.default[0] will be created
  + resource "aws_nat_gateway" "default" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Attributes" = "nat"
          + "Name"       = "nat-use1a"
        }
      + tags_all             = {
          + "Attributes" = "nat"
          + "Name"       = "nat-use1a"
        }
    }

  # module.dynamic_subnets.aws_nat_gateway.default[1] will be created
  + resource "aws_nat_gateway" "default" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Attributes" = "nat"
          + "Name"       = "nat-use1b"
        }
      + tags_all             = {
          + "Attributes" = "nat"
          + "Name"       = "nat-use1b"
        }
    }

  # module.dynamic_subnets.aws_network_acl.private[0] will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes" = "private"
          + "Name"       = "private"
        }
      + tags_all   = {
          + "Attributes" = "private"
          + "Name"       = "private"
        }
      + vpc_id     = (known after apply)
    }

  # module.dynamic_subnets.aws_network_acl.public[0] will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Attributes" = "public"
          + "Name"       = "public"
        }
      + tags_all   = {
          + "Attributes" = "public"
          + "Name"       = "public"
        }
      + vpc_id     = (known after apply)
    }

  # module.dynamic_subnets.aws_network_acl_rule.private4_egress[0] will be created
  + resource "aws_network_acl_rule" "private4_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_network_acl_rule.private4_ingress[0] will be created
  + resource "aws_network_acl_rule" "private4_ingress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_network_acl_rule.public4_egress[0] will be created
  + resource "aws_network_acl_rule" "public4_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_network_acl_rule.public4_ingress[0] will be created
  + resource "aws_network_acl_rule" "public4_ingress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.dynamic_subnets.aws_route.nat4[0] will be created
  + resource "aws_route" "nat4" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
          + delete = "10m"
        }
    }

  # module.dynamic_subnets.aws_route.nat4[1] will be created
  + resource "aws_route" "nat4" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
          + delete = "10m"
        }
    }

  # module.dynamic_subnets.aws_route.public[0] will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {}
    }

  # module.dynamic_subnets.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes" = "private"
          + "Name"       = "private-use1a"
        }
      + tags_all         = {
          + "Attributes" = "private"
          + "Name"       = "private-use1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes" = "private"
          + "Name"       = "private-use1b"
        }
      + tags_all         = {
          + "Attributes" = "private"
          + "Name"       = "private-use1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes" = "public"
          + "Name"       = "public"
        }
      + tags_all         = {
          + "Attributes" = "public"
          + "Name"       = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      +
  ```
  </details>
  *Pusher: @nisalikularatne, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Deployment - Dev`*